{
    "intents": [
    {
    "tag": "greeting",
    "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day", "Hey, how can I assist you?", "Good to see you! How may I help?"],
    "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?", "Hello! How can I assist you today?", "Hi there! How can I be of service?", "Greetings! What can I do for you?"],
    "context": [""]
    },
    {
    "tag": "goodbye",
    "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time", "Until next time", "Take care and goodbye"],
    "responses": ["See you!", "Have a nice day", "Bye! Come back again soon.", "Goodbye! Have a great day!", "Farewell! Feel free to return anytime.", "Take care! See you soon."],
    "context": [""]
    },
    {
    "tag": "thanks",
    "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me", "I appreciate your help", "Thank you for your assistance"],
    "responses": ["Happy to help!", "Any time!", "My pleasure", "You're welcome! It was my pleasure to assist.", "Glad I could help! Let me know if you need anything else.", "No problem at all! Happy to be of service."],
    "context": [""]
    },
    {
    "tag": "noanswer",
    "patterns": [],
    "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "Apologies, but I'm unable to understand. Could you please provide more information?", "I'm sorry, I couldn't comprehend your query. Can you please provide further details?"],
    "context": [""]
    },
    {
    "tag": "options",
    "patterns": ["Can you help me?", "How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered", "What are the services you provide?", "How can your expertise be beneficial?"],
    "responses": ["I can help you with queries related to admissions, hostel, academics", "I can provide information and guidance on admissions, programs, and other academic-related queries. Let me know how I can assist you."],
    "context": [""]
    },
    {
    "tag": "name",
    "patterns": [
    "what is your name",
    "what should I call you",
    "whats your name?"
    ],
    "responses": [
    "You can call me FASTBot.",
    "I'm FASTBot!",
    "The name's Bot. FASTBot."
    ]
    },
    {
    "tag": "goodbye",
    "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day"],
    "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"]
    },
    {
        "tag": "admission",
        "patterns": [
          "How can I apply to FAST University?",
          "What is the application process for FAST University?",
          "I want to apply to FAST University. Can you guide me?",
          "How do I submit my application to FAST University?",
          "Can you provide information on the admission procedure for FAST University?"
        ],
        "responses": [
          "To apply to FAST University, you need to create an account on our website and follow the step-by-step guidelines provided there.",
          "The application process for FAST University involves creating an account on our website, submitting the required documents, and following the instructions provided in the application portal.",
          "Sure! I can help you with your application to FAST University. First, create an account on our website, and then you can follow the instructions to complete your application.",
          "To apply to FAST University, you should visit our official website and create an account. From there, you will find all the necessary information and steps to submit your application.",
          "Applying to FAST University is easy! Just go to our website, create an account, and carefully follow the instructions provided to complete your application."
        ],
        "context": [""]
      },
      {
        "tag": "program",
        "patterns": [
          "What undergraduate programs are available at FAST University?",
          "Tell me about the programs offered at FAST University.",
          "Can you provide information on the programs at FAST University?",
          "Which programs can I pursue at FAST University?"
        ],
        "responses": [
          "FAST University offers a wide range of undergraduate programs, including Computer Science, Electrical Engineering, Business Administration, and more. You can find detailed information about each program on our website.",
          "At FAST University, we offer various undergraduate programs such as Computer Science, Electrical Engineering, Business Administration, and more. Each program has its own unique curriculum and opportunities for students to excel.",
          "FAST University provides a diverse selection of undergraduate programs. Some of our offerings include Computer Science, Electrical Engineering, Business Administration, and more. You can explore each program's details on our website.",
          "We have a variety of undergraduate programs available at FAST University, including Computer Science, Electrical Engineering, Business Administration, and others. Each program is designed to provide students with a strong foundation in their chosen field."
        ],
        "context": [""]
      },
      {
        "tag": "financial aid",
        "patterns": [
          "Does FAST University offer any financial aid or scholarships?",
          "What types of financial aid are available at FAST University?",
          "Can you provide information on financial assistance at FAST University?",
          "How can I apply for financial aid or scholarships at FAST University?"
        ],
        "responses": [
          "FAST University offers financial aid in the form of scholarships and need-based assistance. You can find detailed information on the available financial aid options and the application process on our website.",
          "We understand the importance of financial support for students. FAST University provides various financial aid options, including scholarships and need-based assistance. You can visit our website to learn more about the eligibility criteria and application process.",
          "Yes, FAST University offers financial aid options to eligible students. We have scholarships and need-based assistance programs in place. To apply for financial aid, please visit our website for detailed information and application instructions.",
          "Financial aid opportunities are available at FAST University, including scholarships and need-based assistance. To apply for financial aid or scholarships, please visit our website and navigate to the financial aid section, where you will find all the necessary information and application guidelines."
        ],
        "context": [""]
      },
      {
        "tag": "tuition",
        "patterns": ["What is the tuition", "How much does it cost to attend", "Can you tell me about the fees","What is the cost of tuition at FAST Faisalabad?",
        "How much do I need to pay for attending your university?",
        "Can you provide information about the fees and expenses?"],
        "responses": ["Tuition fee is calculated on tha basis of Credit Hours, currently one credit hour cost 8500-/ PKR. Typically tuition fee for one semester ranges from 140k-150K -/ PKR.","The tuition fee at FAST Faisalabad is determined based on the number of credit hours. Currently, the cost per credit hour is 8,500 PKR. For a typical semester, the tuition fee ranges from 140,000 to 150,000 PKR. Detailed information about the fees and expenses can be found on our website or by contacting the university's finance department.",
        "FAST Faisalabad offers a transparent fee structure. The tuition fee is calculated per credit hour, with each credit hour costing 8,500 PKR. The total tuition fee for a semester depends on the number of credit hours you are enrolled in. Additionally, there might be other fees and expenses associated with specific programs or services. For a detailed breakdown, please refer to our website or get in touch with the finance department."]
    },
    {
        "tag": "campus life",
        "patterns": ["What is campus life like", "What kind of clubs and organizations are available","What is the campus life like at FAST Faisalabad?",
        "Are there any extracurricular activities available for students?",
        "Tell me about the clubs and organizations on campus."],
        "responses": ["We have a vibrant campus life at FAST, where students are provided with an opportunity to learn, grow and groom themselves both academically and professionally."]
    },
    {
        "tag": "admission requirements",
        "patterns": ["What are the admission requirements", "What do I need to get admitted", "What are the admission requirements for undergraduate/graduate programs at FAST University?","What are the admission requirements for FAST Faisalabad?",
        "What documents do I need to submit for admission?",
        "Can you provide information about the admission process at your university?"],
        "responses": ["The admission requirements vary depending on the program you are applying to. Generally, you will need to submit FSC Result Card, test scores, and other materials. You can find more information by creating an account on FAST Admission Portal."]
    },
    {
        "tag": "application process",
        "patterns": ["How do I apply", "What is the application process","How do I apply to FAST Faisalabad?",
        "What is the process for submitting an application?",
        "Can you guide me through the application process?"],
        "responses": ["You can apply online on our website. The application process typically involves submitting transcripts, test scores, and other documents.","You can find step by step guide through the admission process on FAST Admission Portal."]
    },
    {
        "tag": "application deadline",
        "patterns": ["When is the application deadline", "Am I too late to apply","What is the last date to apply in FAST","When is the deadline to submit the application?",
        "Am I too late to apply for this year?",
        "What is the last date to apply?"],
        "responses": ["There are several reminders of the admission applications deadline. You can find the deadline on our social media handles or websites.","If you are late you may still be able to apply as a late applicant.","The last date to apply varies year by year typically it is in the mid of July"]
    },
    {
        "tag": "application status",
        "patterns": ["What is the status of my application", "Have you received my application","How can I check the status of my application?",
        "Have you received my application?",
        "Where can I inquire about my application status?"],
        "responses": ["You can check the status of your application on FAST Admission Portal. If you have any questions, you can contact the admissions office."]
    },
    {
        "tag": "program information",
        "patterns": ["What programs do you offer", "Can you tell me about your programs"],
        "responses": ["We offer a wide range of programs. You can find information about them on our website or by contacting the admissions office."]
    },
    {
        "tag": "financial aid",
        "patterns": ["Do you offer financial aid", "What kind of financial aid is available", "How do I apply for financial aid"],
        "responses": ["Yes, we offer financial aid. You can find information about the types of aid available and how to apply on our website or by contacting the financial aid office."]
    },
    {
        "tag": "scholarships",
        "patterns": ["What scholarships are available", "How do I apply for scholarships","What scholarships are available at FAST Faisalabad?",
        "How can I apply for scholarships?",
        "Are there any merit-based scholarships?"],
        "responses": ["We offer a variety of scholarships for qualified applicants. You can find information about the types of scholarships available and how to apply on our website or by contacting the scholarships office."]
    },
    {
        "tag": "admission events",
        "patterns": ["Are there any admission events coming up", "Can I visit the campus"],
        "responses": ["Yes, we regularly host admission events for prospective students. You can find information about upcoming events on our website or by contacting the admissions office. You can also schedule a visit to our campus."]
    },
    {
        "tag": "international students",
        "patterns": ["Do you accept international students", "What are the admission requirements for international students"],
        "responses": ["Yes, we welcome international students. The admission requirements for international students vary depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."]
    },
    {
        "tag": "health services",
        "patterns": ["Do you offer health services for students", "How do I access health services","Is a doctor available in the campus?"],
        "responses": ["Yes, we offer health services for students","We have an in campus health facility, which you can access in case of any emergency","Yes a doctor is also available in the campus during office hours whereas our health facility remains open 24/7."]
    },
    {
        "tag": "course registration",
        "patterns": ["When can I register for classes", "How do I register for classes"],
        "responses": ["Course registration typically takes place before the start of each semester. You can find more information on our website or by contacting the registrar's office."]
    },
    {
        "tag": "academic advising",
        "patterns": ["Do you offer academic advising", "How do I meet with an academic advisor"],
        "responses": ["Yes, we offer academic advising for students. You can find more information on our website or by contacting the academic advising office."]
    },
    {
        "tag": "orientation",
        "patterns": ["Is there an orientation for new students", "When is orientation"],
        "responses": ["Yes, we offer an orientation program for new students. You can find more information on our website or by contacting the admissions office."]
    },
    {
        "tag": "enrollment deposit",
        "patterns": ["Do I need to pay an enrollment deposit", "When is the enrollment deposit due"],
        "responses": ["Yes, you may be required to pay an enrollment deposit. The amount and due date vary depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."]
    },
    {
        "tag": "deferral",
        "patterns": ["Can I defer my admission", "What is the process for deferral"],
        "responses": ["Yes, you may be able to defer your admission. The process for deferral varies depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."]
    },
    {
        "tag": "admission decision",
        "patterns": ["When will I hear back about my admission decision", "How long does it take to make a decision"],
        "responses": ["The time it takes to make an admission decision varies depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."]
    },
    {
        "tag": "campus life",
        "patterns": ["What is campus life like", "What kind of activities are available"],
        "responses": ["We have a vibrant campus life with many activities and organizations for students. You can find more information on our website or by contacting the student life office."]
    },
    {
        "tag": "admission events",
        "patterns": [
            "Are there any admission events coming up",
            "Can I visit the campus",
            "Are there any upcoming admission events for prospective students?",
            "Can you tell me the schedule of admission events?",
            "I'm interested in attending an admission event. How can I get more information?"
        ],
        "responses": [
            "Yes, we regularly host admission events for prospective students. You can find information about upcoming events on our website or by contacting the admissions office. You can also schedule a visit to our campus."
        ]
    },
    {
        "tag": "international students",
        "patterns": [
            "Do you accept international students",
            "What are the admission requirements for international students",
            "What support services do you offer for international students?",
            "Are there any scholarships available for international students?",
            "Do you provide assistance with visa applications?"
        ],
        "responses": [
            "Yes, we welcome international students. The admission requirements for international students vary depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."
        ]
    },
    {
        "tag": "health services",
        "patterns": [
            "Do you offer health services for students",
            "How do I access health services",
            "Is a doctor available on campus?",
            "Are there any counseling services available for students?",
            "Can I make an appointment with a nurse at the health facility?",
            "What types of medical emergencies can the on-campus health facility handle?"
        ],
        "responses": [
            "Yes, we offer health services for students",
            "We have an on-campus health facility, which you can access in case of any emergency",
            "Yes, a doctor is also available on campus during office hours, whereas our health facility remains open 24/7."
        ]
    },
    {
        "tag": "course registration",
        "patterns": [
            "When can I register for classes",
            "How do I register for classes",
            "Is there a specific time window for course registration?",
            "How many credits can I register for each semester?",
            "Are there any prerequisites or restrictions for certain courses?"
        ],
        "responses": [
            "Course registration typically takes place before the start of each semester. You can find more information on our website or by contacting the registrar's office."
        ]
    },
    {
        "tag": "academic advising",
        "patterns": [
            "Do you offer academic advising",
            "How do I meet with an academic advisor",
            "How often can I meet with an academic advisor?",
            "Can an academic advisor help me with course selection?",
            "Do I need to schedule an appointment for academic advising?"
        ],
        "responses": [
            "Yes, we offer academic advising for students. You can find more information on our website or by contacting the academic advising office."
        ]
    },
    {
        "tag": "orientation",
        "patterns": [
            "Is there an orientation for new students",
            "When is orientation",
            "Is attendance at the orientation program mandatory?",
            "What activities and sessions are included in the orientation program?",
            "Can I bring a family member or friend to the orientation?"
        ],
        "responses": [
            "Yes, we offer an orientation program for new students. You can find more information on our website or by contacting the admissions office."
        ]
    },
    {
        "tag": "enrollment deposit",
        "patterns": [
            "Do I need to pay an enrollment deposit",
            "When is the enrollment deposit due",
            "How can I make the enrollment deposit payment?",
            "Is the enrollment deposit refundable?",
            "What happens if I miss the enrollment deposit deadline?"
        ],
        "responses": [
            "Yes, you may be required to pay an enrollment deposit. The amount and due date vary depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."
        ]
    },
    {
        "tag": "deferral",
        "patterns": [
            "Can I defer my admission",
            "What is the process for deferral",
            "What are the conditions for deferring my admission?",
            "Is there a specific timeframe within which I need to request a deferral?",
            "Can I defer my admission after accepting the offer?"
        ],
        "responses": [
            "Yes, you may be able to defer your admission. The process for deferral varies depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."
        ]
    },
    {
        "tag": "admission decision",
        "patterns": [
            "When will I hear back about my admission decision",
            "How long does it take to make a decision",
            "Will I receive an email or letter regarding my admission decision?",
            "Are there any specific documents or additional steps required after receiving an admission decision?",
            "Can I appeal an admission decision if I am not accepted?"
        ],
        "responses": [
            "The time it takes to make an admission decision varies depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."
        ]
    },
    {
        "tag": "campus life",
        "patterns": [
            "What is campus life like",
            "What kind of activities are available",
            "Are there sports facilities available on campus?",
            "What cultural or social events are organized by the university?",
            "Can you provide some examples of student-run clubs or organizations?"
        ],
        "responses": [
            "We have a vibrant campus life with many activities and organizations for students. You can find more information on our website or by contacting the student life office."
        ]
    },
    {
        "tag": "housing",
        "patterns": [
            "Do you offer on-campus housing",
            "What are the housing options",
            "Can I live on campus as a freshman?",
            "How do I apply for on-campus housing?",
            "Are there single or shared rooms available?",
            "What amenities are included in on-campus housing?"
        ],
        "responses": [
            "Yes, we offer on-campus housing for students. You can find more information about the housing options on our website or by contacting the housing office."
        ]
    },
    {
        "tag": "cost of attendance",
        "patterns": [
            "What is the cost of attendance",
            "How much does it cost to attend",
            "Are there any additional expenses besides tuition?",
            "Are there any scholarships or financial aid options available to help with the cost?",
            "What payment options are available for tuition and fees?"
        ],
        "responses": [
            "The cost of attendance varies depending on the program you are applying to. You can find more information on our website or by contacting the admissions office."
        ]
    },
    {
        "tag": "admission",
        "patterns": [
            "What is the procedure to get admission in FAST?",
            "How can I apply for admission at FAST?",
            "Is there an application deadline for admission?",
            "Are there any specific admission requirements or criteria?"
        ],
        "responses": [
            "First, you have to apply through the website. After that, you have to set preferences and make your merit for the desired program. Then you can submit the fee and get an admission."
        ]
    },
    {
        "tag": "programs",
        "patterns": [
            "What programs are offered in FAST?",
            "Can you provide a list of available programs at FAST?",
            "Are there any specialized programs or majors?",
            "Are there any dual degree programs available?"
        ],
        "responses": [
            "A variety of programs are offered at FAST such as BS Computer Sciences, BS Electrical Engineering, BS Software Engineering, Bachelors in Business Administration. For more information, refer to the FAST Prospectus."
        ]
    },
    {
        "tag": "merits",
        "patterns": [
            "How is the merit of BS CS calculated in FAST?",
            "What factors are considered in the merit calculation for BS CS?",
            "Is the admission test the sole basis for the merit calculation?"
        ],
        "responses": [
            "The merit of BS CS is calculated 50% on the basis of the FAST Admission Test and 50% on the basis of your FSC result."
        ]
    },
    {
        "tag": "admission schedule",
        "patterns": [
            "What is the schedule of admissions in FAST?",
            "When do the admissions for FAST start?",
            "Are there any specific dates for application submission and admission tests?"
        ],
        "responses": [
            "The admissions start in May and are open till the end of June. For exact dates, visit our website."
        ]
    },
    {
        "tag": "apply to FAST",
        "patterns": [
            "How to apply in FAST?",
            "What is the application process for FAST?",
            "Is there an online application form available?"
        ],
        "responses": [
            "Create an account on our website, fill out the details, and submit the application fee. Then, you have to pass the admission test."
        ]
    },
    {
        "tag": "scholarship",
        "patterns": [
            "Can I get a scholarship in FAST?",
            "Are there any scholarships available for students at FAST?",
            "What are the eligibility criteria for scholarships?"
        ],
        "responses": [
            "Yes, you can get a scholarship in FAST. FAST provides multiple scholarships to its students. Moreover, you can also apply for financial assistance. For more information, contact our campus representative."
        ]
    },
    {
        "tag": "test pattern",
        "patterns": [
            "What is the test pattern of the admission test in FAST?",
            "How many sections are there in the admission test?",
            "Which subjects are included in the admission test?"
        ],
        "responses": [
            "The admission test contains questions from Mathematics, Physics, Analytical Skills, and English. Each portion has a specific weightage."
        ]
    },
    {
        "tag": "fee structure",
        "patterns": [
            "What is the fee structure in FAST?",
            "How much is the tuition fee?",
            "Are there any additional fees besides tuition?",
            "Can I pay the fees in installments?",
            "Are there any discounts available for early payment?"
        ],
        "responses": [
            "The fee is calculated in terms of Credit Hour. The fee for the first semester ranges from 150K-200K, depending upon your credit hours, admission processing fee, and other variables."
        ] 
    },
    {
        "tag": "courses",
        "patterns": [
            "What courses will I study in FAST?",
            "Can you provide a course list for the program I'm interested in?",
            "Are there any core courses that all students are required to take?"
        ],
        "responses": [
            "You will study different courses over the span of 4 years, depending upon the program you choose."
        ]
    },
    {
        "tag": "hostel",
        "patterns": [
            "Is Hostel Facility available in FAST?",
            "Are there hostels for students at FAST?",
            "Can I stay in a hostel while studying at FAST?"
        ],
        "responses": [
            "Currently, on-campus hostel facility is only available at FAST-Chiniot Faisalabad Campus."
        ]
    },
    {
        "tag": "hostel room",
        "patterns": [
            "How do I get a room in FAST Hostel?",
            "What is the process to book a room in FAST Hostel?",
            "Are there any requirements to get a room in FAST Hostel?"
        ],
        "responses": [
            "You can get a form for accommodations from FAST Faisalabad Hostel office. Fill it out and submit the fee. You will be accommodated in the hostel."
        ]
    },
    {
        "tag": "room change",
        "patterns": [
            "How can I change my room in the hostel?",
            "Is it possible to switch rooms in the hostel?"
        ],
        "responses": [
            "You can change your room by submitting an application to the hostel supervisor's office."
        ]
    },
    {
        "tag": "room luggage",
        "patterns": [
            "Is room for luggage provided in the hostel?",
            "Are there storage facilities for luggage in the hostel?"
        ],
        "responses": [
            "Yes, a closet will be provided in the room for your luggage."
        ]
    },
    {
        "tag": "mosque",
        "patterns": [
            "Is a Mosque available in the hostel?",
            "Are there prayer facilities in the hostel?"
        ],
        "responses": [
            "Yes, there is a mosque situated in the hostel as well as on the campus."
        ]
    },
    {
        "tag": "hostel fee",
        "patterns": [
            "What are the dues for Hostel?",
            "What is the fee for the hostel?",
            "What are the charges for a hostel room?"
        ],
        "responses": [
            "The dues for the hostel currently for a shared room in the boys' hostel are 41,000 PKR, for a single room 55,000 PKR, and for a double room 48,000 PKR. You may need to submit hostel security fee and mess security fee if you're getting a room for the first time, which are 8,000 PKR and 7,000 PKR, respectively."
        ]
    },
    {
        "tag": "program change",
        "patterns": [
            "Can I change my program during the degree?",
            "Is it possible to switch programs after enrollment?",
            "What is the process for changing my program?"
        ],
        "responses": [
            "Yes, it may be permissible under most circumstances for a specific time limit. For exact details, you should contact the academic office."
        ]
    },
    {
        "tag": "transfer degree",
        "patterns": [
            "Can I transfer my degree from any campus to Fast Faisalabad?",
            "Is it possible to transfer my program to Fast Faisalabad campus?",
            "Are there any requirements for transferring my degree?"
        ],
        "responses": [
            "Yes, you can transfer your program from any other campus of FAST to FAST Faisalabad after completing the requirements."
        ]
    },
    {
        "tag": "credit hours",
        "patterns": [
            "How many credit hours are there in a BS Program?",
            "What is the total number of credit hours for a BS degree?",
            "Are there any credit hour requirements for graduation?"
        ],
        "responses": [
            "There are a total of 130 credit hours required for an undergraduate degree program."
        ]
    },
    {
        "tag": "credit hours",
        "patterns": [
            "What is the cost of 1 credit hour?",
            "How much does each credit hour cost?",
            "Is there a specific fee for each credit hour?"
        ],
        "responses": [
            "The tentative tuition fee per credit hour is 8,500 PKR for the academic year 2021-2022."
        ]
    },
    {
        "tag": "admission fee",
        "patterns": [
            "What is the admission fee?",
            "How much do I need to pay as an admission fee?"
        ],
        "responses": [
            "The admission fee of Rs 20,000 is payable once at the time of admission."
        ]
    },
    {
        "tag": "security fee",
        "patterns": [
            "What is the security fee?",
            "Do I need to pay any security deposit?"
        ],
        "responses": [
            "A refundable security deposit of Rs 20,000 is also payable at the time of admission."
        ]
    },
    {
        "tag": "withholding tax",
        "patterns": [
            "Is there any withholding tax on the fee?",
            "Do I need to pay withholding tax for the tuition fee?"
        ],
        "responses": [
            "The university shall collect advance tax from a person not appearing on the active taxpayers list (ATL) at 5% on the entire amount of fee paid, provided that the annual fee paid exceeds Rs. 200,000."
        ]
    },
    {
        "tag": "fee refund",
        "patterns": [
            "What is the fee refund policy of FAST?",
            "Can I get a refund for my tuition fee if I withdraw?"
        ],
        "responses": [
            "Tuition Fee is refunded in accordance with the guidelines of Higher Education Commission (HEC)."
        ]
    },
    {
        "tag": "admission fee",
        "patterns": [
            "Is the admission fee refundable?",
            "Can I get a refund for the admission fee?"
        ],
        "responses": [
            "No, the admission fee is not refundable."
        ]
    },
    {
        "tag": "tuition fee",
        "patterns": [
            "How can I pay my tuition fee at FAST?",
            "What are the payment options for tuition fee?"
        ],
        "responses": [
            "You can pay your tuition fee at any branch of Faysal Bank. Moreover, you can also pay through QuickPay. For more details, visit the fee section in Flex."
        ]
    },
    {
        "tag": "complaint",
        "patterns": [
            "How can I lodge my complaint if anything goes wrong?",
            "What should I do if I have a complaint?",
            "Where can I report a problem or issue?",
            "Is there a complaint procedure in place?"
        ],
        "responses": [
            "There is a complaint management system in place at FAST Faisalabad. Moreover, you can also email your complaint to the relevant authorities."
        ]
    },
    {
        "tag": "hostel meals",
        "patterns": [
            "How many meals are served in the hostel?",
            "What is the meal schedule in the hostel?",
            "When are the meals served in the hostel?"
        ],
        "responses": [
            "Three meals are served in the mess regularly: breakfast, lunch, and dinner."
        ]
    },
    {
        "tag": "meal cost",
        "patterns": [
            "What is the cost of a meal in the hostel?",
            "How much do the hostel meals cost?",
            "Are the hostel meals included in the fees?"
        ],
        "responses": [
            "The cost of meals varies according to the meal being served."
        ]
    },
    {
        "tag": "room types",
        "patterns": [
            "What type of rooms are available in FAST?",
            "Are there different types of rooms in the hostel?",
            "Tell me about the accommodation options at FAST."
        ],
        "responses": [
            "For Boys: Single, Double, and Shared Rooms are available in the hostel. For Girls: Shared Rooms are available in the hostel."
        ]
    },
    {
        "tag": "shared room",
        "patterns": [
            "How many students are there in a shared room?",
            "What is the occupancy of a shared room?"
        ],
        "responses": [
            "There are a total of 6 students in a shared room."
        ]
    },
    {
        "tag": "single room cost",
        "patterns": [
            "What are the dues of a single-person room?",
            "What is the cost of a single-person room?",
            "How much does a single room in the hostel cost?"
        ],
        "responses": [
            "The dues of a single room are 55,000 PKR."
        ]
    },
    {
        "tag": "shared room cost",
        "patterns": [
            "What are the dues for a shared room?",
            "What is the cost of a shared room?",
            "How much does a shared room in the hostel cost?"
        ],
        "responses": [
            "The dues of a shared room are 41,000 PKR."
        ]
    },
    {
        "tag": "campus change",
        "patterns": [
            "What is the process to change FAST Campus?",
            "Can I transfer to a different FAST campus?",
            "How can I switch to another FAST campus?"
        ],
        "responses": [
            "You can change the campus by appearing on the merit of your desired campus and program upon retaking the Fast admission test."
        ]
    },
    {
        "tag": "credit transfer",
        "patterns": [
            "Are credits transferred when I change a campus?",
            "Can I transfer my credits to another campus?",
            "Will my previous credits be recognized if I change the campus?"
        ],
        "responses": [
            "Yes, the credits are transferred when you change a campus."
        ]
    },
    {
        "tag": "sports facility",
        "patterns": [
            "Are there any sports facilities available on campus?",
            "Tell me about the sports facilities at FAST.",
            "Can I participate in sports activities at FAST?"
        ],
        "responses": [
            "Yes, there are a lot of sports facilities available in FAST Faisalabad, including table tennis, cricket, football, futsal, and badminton."
        ]
    },
    {
        "tag": "gym",
        "patterns": [
            "Is there a gym in FAST Faisalabad Hostel?",
            "Do you have a gym facility in the hostel?",
            "Can I work out in the hostel?"
        ],
        "responses": [
            "Yes, there is a gym available in the hostel. You can get the membership once you are allocated a room in the hostel."
        ]
    },
    {
        "tag": "campus size",
        "patterns": [
            "How big is the Faisalabad Campus of FAST?",
            "Tell me about the size of the campus in Faisalabad.",
            "How much area does the Faisalabad Campus cover?"
        ],
        "responses": [
            "FAST Faisalabad is a big campus comprising almost 30 acres of land."
        ]
    },
    {
        "tag": "campus location",
        "patterns": [
            "Where is FAST Faisalabad located?",
            "Tell me the address of FAST Faisalabad.",
            "What is the location of FAST in Faisalabad?"
        ],
        "responses": [
            "FAST Faisalabad is located at Sargodha Road, 10km from the Motorway Interchange at Loonaywala Stop."
        ]
    },
    {
        "tag": "night cafe",
        "patterns": [
            "Is there a night cafe in FAST Faisalabad hostel?",
            "Do you have a cafe that operates at night in the hostel?",
            "Can I get food during late hours in the hostel?"
        ],
        "responses": [
            "Yes, there is a night café (Dhaba) available at FAST Faisalabad."
        ]
    },
    {
        "tag": "degree",
        "patterns": [
            "Is it tough to get a degree from FAST?",
            "How challenging is it to obtain a degree from FAST?",
            "What is the level of difficulty in earning a degree from FAST?"
        ],
        "responses": [
            "It's certainly challenging, but if you're determined, then you'll get all the help you need."
        ]
    },
    {
        "tag": "duration BS programs",
        "patterns": [
            "What is the duration of BS Programs in FAST?",
            "How long does it take to complete a BS Program at FAST?",
            "Tell me about the length of the BS Programs at FAST."
        ],
        "responses": [
            "The duration of the BS Program is 4 years, which consists of 8 semesters."
        ]
    },
    {
        "tag": "duration MS programs",
        "patterns": [
            "What is the duration of MS Program in FAST?",
            "How long does it take to complete an MS Program at FAST?",
            "Tell me about the length of the MS Programs at FAST."
        ],
        "responses": [
            "The duration of MS Programs is 2 years as mandated by the HEC."
        ]
    },
    {
        "tag": "PHD",
        "patterns": [
            "Is a PhD Program available at FAST?",
            "Can I pursue a PhD at FAST?",
            "Tell me about the PhD Programs offered at FAST."
        ],
        "responses": [
            "Yes, PhD Programs are available at FAST under the supervision of HEC-approved PhD supervisors."
        ]
    },
    {
        "tag": "labs",
        "patterns": [
            "Are modern labs available at FAST?",
            "Tell me about the labs at FAST.",
            "Do you have well-equipped labs at FAST?"
        ],
        "responses": [
            "Yes, all campuses of FAST have modern, up-to-date labs available."
        ]
    },
    {
        "tag": "internet",
        "patterns": [
            "Is the internet available at FAST?",
            "Do you provide internet access on campus?",
            "Can I connect to the internet at FAST?"
        ],
        "responses": [
            "Yes, the whole campus is under internet coverage."
        ]
    },
    {
        "tag": "admission",
        "patterns": [
        "What is the procedure to get admission in FAST?",
        "How can I get admission in FAST?",
        "Tell me about the admission process in FAST."
        ],
        "responses": [
        "First, you have to apply through the website. After that, you have to set preferences and make your merit for the desired program. Then, you can submit the fee and get admission."
        ]
        },
        {
        "tag": "programs",
        "patterns": [
        "What programs are offered in FAST?",
        "Which courses can I study in FAST?",
        "Tell me about the available programs in FAST."
        ],
        "responses": [
        "FAST offers a variety of programs such as BS Computer Sciences, BS Electrical Engineering, BS Software Engineering, and Bachelors in Business Administration. For more information, please refer to the FAST Prospectus."
        ]
        },
        {
        "tag": "merits",
        "patterns": [
        "How is the merit calculated in FAST?",
        "What is the basis for merit calculation in FAST?",
        "Tell me about the merit calculation process in FAST."
        ],
        "responses": [
        "The merit is calculated based on 50% of the Fast Admission Test and 50% on the basis of your FSC result."
        ]
        },
        {
        "tag": "admission schedule",
        "patterns": [
        "What is the schedule of admissions in FAST?",
        "When does the admission process start in FAST?",
        "Tell me the dates for admissions in FAST."
        ],
        "responses": [
        "The admissions start in May and are open until the end of June. For exact dates, please visit our website."
        ]
        },
        {
        "tag": "apply to FAST",
        "patterns": [
        "How to apply to FAST?",
        "What are the steps for applying to FAST?",
        "Tell me the application process for FAST."
        ],
        "responses": [
        "To apply to FAST, create an account on our website, fill out the details, and submit the application fee. Then, you have to pass the admission test."
        ]
        },
        {
        "tag": "scholarship",
        "patterns": [
        "Can I get a scholarship in FAST?",
        "Tell me about the scholarships offered in FAST.",
        "How can I apply for a scholarship in FAST?"
        ],
        "responses": [
        "Yes, you can get a scholarship in FAST. FAST provides multiple scholarships to its students. Moreover, you can also apply for Financial Assistance. For more information, please contact our campus representative."
        ]
        },
        {
        "tag": "test pattern",
        "patterns": [
        "What is the test pattern of the admission test in FAST?",
        "How is the admission test conducted in FAST?",
        "Tell me about the format of the admission test in FAST."
        ],
        "responses": [
        "The admission test contains questions from Mathematics, Physics, Analytical Skills, and English. Each portion has a specific weightage."
        ]
        },
        {
        "tag": "fee structure",
        "patterns": [
        "What is the fee structure in FAST?",
        "How much do I have to pay for the program in FAST?",
        "Tell me about the fees for studying in FAST."
        ],
        "responses": [
        "The fee is calculated in terms of Credit Hours. The fee for the first semester ranges from 150K-200K depending upon your credit hours, admission processing fee, and other variables."
        ]
        },
        {
        "tag": "courses",
        "patterns": [
        "What courses will I study in FAST?",
        "Tell me about the curriculum in FAST.",
        "Which subjects are included in the programs at FAST?"
        ],
        "responses": [
        "You will study different courses over the span of 4 years, depending upon the program you choose."
        ]
        },
        {
        "tag": "hostel",
        "patterns": [
        "Is hostel facility available in FAST?",
        "Tell me about the accommodation options in FAST.",
        "Can I stay in the hostel while studying in FAST?"
        ],
        "responses": [
        "Currently, on-campus hostel facility is only available at FAST-Chiniot Faisalabad Campus."
        ]
        },
        {
        "tag": "hostel room",
        "patterns": [
        "How do I get a room in FAST Hostel?",
        "What is the process for obtaining a room in FAST Hostel?",
        "Tell me about the procedure for hostel room allocation in FAST."
        ],
        "responses": [
        "To get a room in FAST Hostel, you can obtain a form for accommodations from the FAST Faisalabad Hostel office. Fill it out and submit the required fee. You will be accommodated in the hostel."
        ]
        },
        {
        "tag": "hostel fee",
        "patterns": [
        "What are the dues for Hostel?",
        "How much do I have to pay for the hostel room?",
        "Tell me about the charges for staying in the hostel."
        ],
        "responses": [
        "The dues for the hostel currently for a shared room in boys hostel are 41000-/ PKR, for a single room 55000-/ PKR, and for a double room 48000-/ PKR. You may need to submit hostel security fee and mess security fee if you're getting a room for the first time, which are 8000-/ and 7000-/ respectively."
        ]
        },
        {
        "tag": "hostel meals",
        "patterns": [
        "How many meals are served in the hostel?",
        "Tell me about the meal services in the hostel.",
        "What is the meal plan in the hostel?"
        ],
        "responses": [
        "3 meals are served in the mess regularly: Breakfast, Lunch, and Dinner."
        ]
        },
        {
        "tag": "meal cost",
        "patterns": [
        "What is the cost of meals in the hostel?",
        "How much do I have to pay for the meals in the hostel?",
        "Tell me about the charges for the hostel meals."
        ],
        "responses": [
        "The cost of meals varies according to the meal being served."
        ]
        },
        {
        "tag": "room types",
        "patterns": [
        "What types of rooms are available in FAST?",
        "Tell me about the different room options in FAST Hostel.",
        "What are the types of accommodations in the hostel?"
        ],
        "responses": [
        "For Boys: Single, Double, and Shared Rooms are available in the hostel. For Girls: Shared Rooms are available in the hostel."
        ]
        },
        {
        "tag": "shared room",
        "patterns": [
        "How many students are there in a shared room?",
        "Tell me about the occupancy of a shared room in the hostel.",
        "How many students share a room in the hostel?"
        ],
        "responses": [
        "There are a total of 6 students in a shared room."
        ]
        },
        {
        "tag": "single room cost",
        "patterns": [
        "What are the dues of a single person room?",
        "How much do I have to pay for a single room?",
        "Tell me about the charges for staying in a single person room."
        ],
        "responses": [
        "The dues for a single room are 55000 -/ PKR."
        ]
        },
        {
        "tag": "shared room cost",
        "patterns": [
        "What are the dues for a shared room?",
        "How much do I have to pay for a shared room?",
        "Tell me about the charges for staying in a shared room."
        ],
        "responses": [
        "The dues for a shared room are 41000-/ PKR."
        ]
        },
        {
        "tag": "campus change",
        "patterns": [
        "What is the process to change FAST Campus?",
        "How can I transfer to a different campus in FAST?",
        "Tell me about the procedure for changing the FAST Campus."
        ],
        "responses": [
        "You can change the campus by appearing on the merit of your desired campus and program upon retaking the Fast admission test."
        ]
        },
        {
        "tag": "credit transfer",
        "patterns": [
        "Are credits transferred when I change a campus?",
        "Can I transfer my credits to a different campus in FAST?",
        "Tell me about the credit transfer policy in FAST."
        ],
        "responses": [
        "Yes, the credits are transferred when you change a campus."
        ]
        },
        {
        "tag": "sports facility",
        "patterns": [
        "Are there any sports facilities available on campus?",
        "Tell me about the sports facilities in FAST.",
        "What sports activities are offered in FAST?"
        ],
        "responses": [
        "Yes, there are a lot of sports facilities available in FAST Faisalabad, including table tennis, cricket, football, futsal, and badminton."
        ]
        },
        {
        "tag": "gym",
        "patterns": [
        "Is there a gym in Fast Faisalabad Hostel?",
        "Tell me about the gym facilities in FAST Hostel.",
        "Can I access a gym while staying in FAST Hostel?"
        ],
        "responses": [
        "Yes, there is a gym available in the hostel. You can get a membership once you are allocated a room in the hostel."
        ]
        },
        {
        "tag": "campus size",
        "patterns": [
        "How big is the Faisalabad Campus of Fast?",
        "Tell me about the size of FAST Faisalabad Campus.",
        "What is the area of FAST Faisalabad Campus?"
        ],
        "responses": [
        "FAST Faisalabad is a big campus comprising almost 30 acres of land."
        ]
        },
        {
        "tag": "campus location",
        "patterns": [
        "Where is FAST Faisalabad located?",
        "Tell me about the location of FAST Faisalabad Campus.",
        "What is the address of FAST Faisalabad?"
        ],
        "responses": [
        "FAST Faisalabad is located at Sargodha Road, 10 km from the Motorway Interchange at Loonaywala Stop."
        ]
        },
        {
            "tag": "bs selection criteria ",
            "patterns": ["What is the selection criteria for Bachelors?"],
            "responses": ["Selection Crieria for Bachelors is as follows:- 50% weight to higher percent score of SSC (or an equivalent exam) OR HSSC (or an equivalent exam) and 50% weight to marks obtained in Admission Test."]
      
        }
        ,
        {
            "tag": "masters selection criteria",
            "patterns": ["What is the selection criteria for Masters?"],
            "responses": ["Selection Criteria of Master is as follows:- Past Academic Record (Bachelor): 50% and Performance in NU subject Admission Test: 50%"]
      
        }
        ,
        {
            "tag": "bachelors selection criteria ",
            "patterns": ["What is the selection criteria for Bachelors?"],
            "responses": ["Selection Crieria for Bachelors is as follows:- 50% weight to higher percent score of SSC (or an equivalent exam) OR HSSC (or an equivalent exam) and 50% weight to marks obtained in Admission Test."]
      
        }
        ,
        {
            "tag": "ms selection criteria",
            "patterns": ["What is the eligibilty criteria for ms?"],
            "responses": ["Selection Criteria of Master is as follows:- Past Academic Record (Bachelor): 50% and Performance in NU subject Admission Test: 50%"]
      
        }
        ,
        {
            "tag": "masters eligibility criteria",
            "patterns": ["What is the eligibilty criteria for Masters?"],
            "responses": ["Eligibility Criteria of MS is as follows:-  Degree in relevant subject earned after 16 years of education from an HEC recognized university and At least 60% marks or CGPA of at least 2.0 (on a scale of 4.0) and Two years of post qualification experience in software development or related area."]
      
        }
        ,
        {
            "tag": "masters in computer science eligibility criteria",
            "patterns": ["What is the eligibilty criteria for masters in computer sciences?"],
            "responses": ["Eligibility Criteria of MS CS is as follows:-  Degree in relevant subject earned after 16 years of education from an HEC recognized university and At least 60% marks or CGPA of at least 2.0 (on a scale of 4.0) and Two years of post qualification experience in software development or related area."]
      
        }
        ,
        {
            "tag": "ms in computer eligibility criteria",
            "patterns": ["What is the eligibilty criteria for ms in computer science?"],
            "responses": ["Eligibility Criteria of MS CS is as follows:-  Degree in relevant subject earned after 16 years of education from an HEC recognized university and At least 60% marks or CGPA of at least 2.0 (on a scale of 4.0) and Two years of post qualification experience in software development or related area."]
      
        }
        ,
        {
            "tag": "ms cs eligibility criteria",
            "patterns": ["What is the eligibilty criteria for ms cs?"],
            "responses": ["Eligibility Criteria of MS CS is as follows:-  Degree in relevant subject earned after 16 years of education from an HEC recognized university and At least 60% marks or CGPA of at least 2.0 (on a scale of 4.0) and Two years of post qualification experience in software development or related area."]
      
        }
        ,
        {
            "tag": "masters in cs eligibility criteria",
            "patterns": ["What is the eligibilty criteria for masters in cs?"],
            "responses": ["Eligibility Criteria of MS CS is as follows:-  Degree in relevant subject earned after 16 years of education from an HEC recognized university and At least 60% marks or CGPA of at least 2.0 (on a scale of 4.0) and Two years of post qualification experience in software development or related area."]
      
        }
        ,
        {
            "tag": "bachelors in business administration eligibility_criteria",
            "patterns": ["What is the eligibilty criteria for bba?"],
            "responses": ["Eligibility Criteria of BBA is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "bba eligibility criteria",
            "patterns": ["What is the eligibilty criteria for bachelors in business administration?"],
            "responses": ["Eligibility Criteria of Bachelors in Business Administration is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "bs engineering eligibility criteria",
            "patterns": ["What is the eligibilty criteria for bs engineering?"],
            "responses": ["Eligibility Criteria of Engineering is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "bs computer science eligibility criteria",
            "patterns": ["What is the eligibility criteria for bs in computer science?"],
            "responses": ["Eligibility Criteria of BS CS is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "bachelors in cs eligibility criteria",
            "patterns": ["What is the eligibilty criteria for bachelors in cs?"],
            "responses": ["Eligibility Criteria of BS CS is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "bachelors in computer science admission criteria",
            "patterns": ["What is the eligibilty criteria for bachelors in computer science?"],
            "responses": ["Eligibility Criteria of BS CS is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "bs cs eligibility criteria",
            "patterns": ["What is the eligibilty criteria for bs cs?"],
            "responses": ["Eligibility Criteria of BS CS is as follows:- At least 60% marks in SSC (Matric) or an equivalent examination (such as O-levels) and should have studied for HSSC or an equivalent qualification, for at least two years and At least 60% marks in the Pre-Engineering or an equivalent examination"]
      
        }
        ,
        {
            "tag": "foreign national",
            "patterns": ["I am a foreign national can I apply in FAST?"],
            "responses": ["Yes you can apply in fast if you're a foreign national. You must submit an NOC from the Ministry of Education."]
      
        }
        ,
        {
            "tag": "admit card",
            "patterns": ["what is admit card? Do I need the admit card to appear in the exam?"],
            "responses": ["Admit Card is the verification that you are an eligible candidate. You must carry it with you on the dat of admission test."]
      
        }
        ,
        {
            "tag": "admission application fee refundable",
            "patterns": ["Is admission application fee refundable?"],
            "responses": ["The application admission fee is non-refundable."]
      
        }
        ,
        {
            "tag": "application challan",
            "patterns": ["What is application challan?", "Where can I submit my application admission fee?"],
            "responses": ["Application Challan is generated on admission portal after you have complete your registration. You can pay the challan at any branch of Faysal Bank."]
      
        }
        ,
        {
            "tag": "arn",
            "patterns": ["what is arn?", "Do I need arn?"],
            "responses": ["The online system assigns a unique Application Reference Number (ARN) to each applicant, which must be noted for later use."]
      
        }
        ,
        {
            "tag": "post applications",
            "patterns": ["can I mail my application through mail or tcs?"],
            "responses": ["No, only online applications through Fast Admission Portal are accepted."]
      
        }
        ,
        {
            "tag": "phd admission test pattern",
            "patterns": ["what is the pattern of phd admission test? "],
            "responses": ["The PhD admission test contains 100 MCQ's from programming, automata, operating systems,database, oop artificial intelligence and algorithms domain plus 30% weghtage is for Essay Writing."]
      
        }
        ,
        {
            "tag": "sample admission tests",
            "patterns": ["Where can I found old admission tests?"],
            "responses": ["You can find old admission test sample papers on our webiste as well as on the internet."]
      
        }
        ,
        {
            "tag": "ms computing admission test pattern",
            "patterns": ["what is the pattern of ms admission test? Describe masters admission test pattern? Tell me about ms admission test pattern?"],
            "responses": ["MS Program test pattern is as follows:- Essay Writing 10%, Analytical Skills and IQ 30%,Specialization Area 30%,Quantitative Methods 30%."]
      
        }
        ,
        {
            "tag": "master of business administration admission test pattern",
            "patterns": ["what is the pattern of mba admission test? Describe master in business administration admission test pattern? Tell me about ms admission test pattern?"],
            "responses": ["MBA test pattern is as follows:- English 10%, Analytical Skills and IQ 20%,Essay Writing 30%,Quantitaive Methods 20%,Business Related Knowledge 20%."]
      
        }
        ,
        {
            "tag": "mba admission test pattern",
            "patterns": ["what is the pattern of mba admission test? Describe master in business administration admission test pattern? Tell me about ms admission test pattern?"],
            "responses": ["MBA test pattern is as follows:- English 10%, Analytical Skills and IQ 20%,Essay Writing 30%,Quantitaive Methods 20%,Business Related Knowledge 20%."]
      
        }
        ,
        {
            "tag": "ee test pattern",
            "patterns": ["what is the pattern of electrical engineering admission test? Describe ee admission test pattern? Tell me about ee admission test pattern?"],
            "responses": ["CS and Engineering Admission test pattern is as follows:- English 10%, Analytical Skills and IQ 20%,Basic Math 20%,Advance Math 50%."]
      
        }
        ,
        {
            "tag": "computer science admission test pattern",
            "patterns": ["what is the pattern of cs admission test? Describe computer science admission test pattern? Tell me about cs admission test pattern?"],
            "responses": ["CS and Engineering Admission test pattern is as follows:- English 10%, Analytical Skills and IQ 20%,Basic Math 20%,Advance Math 50%."]
      
        }
        ,
        {
            "tag": "bba test pattern",
            "patterns": ["what is the pattern of bba admission test? Describe bachelors of business  admission test pattern? Tell me about ee admission test pattern?"],
            "responses": ["BBA and BS Admission test pattern is as follows:- English 10%, Analytical Skills and IQ 25%,Essay Writing 15%,Basic Math 50%."]
      
        }
        ,
        {
            "tag": "bachelors of business administration test pattern",
            "patterns": ["what is the pattern of bba admission test? Describe bachelors of business  admission test pattern? Tell me about ee admission test pattern?"],
            "responses": ["BBA and BS Admission test pattern is as follows:- English 10%, Analytical Skills and IQ 25%,Essay Writing 15%,Basic Math 50%."]
      
        }
        ,
        {
            "tag": "electrical engineering test_pattern",
            "patterns": ["what is the pattern of electrical engineering admission test? Describe ee admission test pattern? Tell me about ee admission test pattern?"],
            "responses": ["CS and Engineering Admission test pattern is as follows:- English 10%, Analytical Skills and IQ 20%,Basic Math 20%,Advance Math 50%."]
      
        }
        ,
        {
            "tag": "cs admission test pattern",
            "patterns": ["what is the pattern of cs admission test? Describe computer science admission test pattern? Tell me about cs admission test pattern?"],
            "responses": ["CS and Engineering Admission test pattern is as follows:- English 10%, Analytical Skills and IQ 20%,Basic Math 20%,Advance Math 50%."]
      
        }
        ,
        {
            "tag": "admission test details",
            "patterns": ["what is the composition of admission test?, What is the percentage of each subject in admission test, what subjects are included in the admission test?, What is the test pattern of fast admission test?"],
            "responses": ["The pattern for admission test vary by each program."]
      
        }
        ,
        {
            "tag": "number of admission test",
            "patterns": ["How many times can I give admission test?"],
            "responses": ["You can give 1 admission test in an academic year"]
      
        }
        ,
        {
            "tag": "score in fast admission test",
            "patterns": ["How much score do I need in FAST Admission test?"],
            "responses": ["There is no bar set for the score in Fast Admission Test. You just need to appear on the merit."]
      
        }
        ,
        {
            "tag": "marks in fsc",
            "patterns": ["How much marks do I need in FSc to secure a seat in Fast?"],
            "responses": ["As per HEC Policy you need to secure at least 60% marks in FSc."]
      
        }
        ,
        {
            "tag": "secure seat",
            "patterns": ["How can I secure a seat in Fast Faisalabad?"],
            "responses": ["You need to secure a seat by appearing on the merit. Merit changes every year"]
      
        }
        ,
        {
            "tag": "previous merit",
            "patterns": ["What was the previous merit of Fast Faisalabad?"],
            "responses": ["As per our policy we don’t disclose the closing merit."]
      
        }
        ,
        {
            "tag": "applied in islamabad",
            "patterns": ["I applied in FAST Islamabad, Can I get an admission in FAST Faisalabad?"],
            "responses": ["Yes you can still get admission in Faisalabad, Contact our admission office immediately as the number of seats are limited."]
      
        }
        ,
        {
            "tag": "applied in lahore",
            "patterns": ["I applied in FAST Lahore, Can I get an admission in FAST Faisalabad?"],
            "responses": ["Yes you can still get admission in Faisalabad, Contact our admission office immediately as the number of seats are limited."]
      
        }
        ,
        {
            "tag": "did not apply in fast faisalabad",
            "patterns": ["I did not apply in FAST Faisalabad, Can I still get an admission?"],
            "responses": ["Yes you can still get admission in Faislabad, If there are seats available. If you want to get an admission contact our admission office immediately."]
      
        }
        ,
        {
            "tag": "transfer seat",
            "patterns": ["Can I transfer my seat from any other campus to Faisalabad?"],
            "responses": ["Yes you can transfer your program and credit hours from any other campus to Faisalabad by completing the requirements."]
      
        }
        ,
        {
            "tag": "Daira",
            "patterns": ["What is Daira?"],
            "responses": ["Daira is our annual olympiad which is held annually in March. Autoshow, Pet Show, Theatre and skill tests every competition category is included in Daira."]
      
        }
        ,
        {
            "tag": "cricket league",
            "patterns": ["Does fast hold cricket league?"],
            "responses": ["Yes we have a special tournamel called FAST Cricket League. Bidding is done to own the best teams. Winner is rewarded with a hefty amount."]
      
        }
        ,
        {
            "tag": "recreational actvities",
            "patterns": ["what recreational activities are avialbale at fast?"],
            "responses": ["Fast has a variety of recreational activities. Daira our Annual Olympiad is held each year in March which attracts audience and participants from all across the country."]
      
        }
        ,
        {
            "tag": "sports activities",
            "patterns": ["what type of sports activities are available in fast? "],
            "responses": [" Fast Faisalabad has a variety of sports activities. Our sports society organizes Fast Premiere Football Leagues, Night Crciket Leagues as well as table tennis, badminton and fusball tournaments each semester."]
      
        }
        ,
        {
            "tag": "fast premiere league",
            "patterns": ["What is Fast Primere League?"],
            "responses": ["FAST premiere league is our premiere foorball league which is held each semester."]
      
        }
        ,


        {
            "tag": "Airconditioners in classrooms",
            "patterns": ["Are the classes airconditioned?","Are there air conditioners available in classrooms?","Is the campus centrally air conditioned?"],
            "responses": ["Yes, air conditioners are available in every classroom and every other facility within the campus."]
      
        } ,

        {
            "tag": "Airconditioners at hostel",
            "patterns": ["Are rooms at hostel air conditioned?"],
            "responses": ["No, hostel rooms are not air conditioned."]
      
        } ,

        {
            "tag": "library for hostelites",
            "patterns": ["Can hostelites use library after 5pm","Does hostel has library?"],
            "responses": ["Yes, hostelites can use the library after 5pm during mids and before finals."]
      
        } ,

        {
            "tag": "microwave at hostel",
            "patterns": ["Is microwave available at hostel?"],
            "responses": ["Yes, microwave is available at hostel?"]
      
        } ,

        {
            "tag": "refrigerator at hostel?",
            "patterns": ["Is refrigerator available at hostel?","Can students use refrigerator at hostel?"],
            "responses": ["Yes, refrigerator is available at hostel and students can use it."]
      
        } ,

        {
            "tag": "hostel mess schedule",
            "patterns": ["What is the hostel mess schedule?"],
            "responses": ["Hostel mess schedule is changed monthly. Every new schedule is mailed to the students monthly."]
      
        } ,

        {
            "tag": "hostel fee installments",
            "patterns": ["Can I pay me hostel fee in installments?","Is installment option available for hostel fee submission?"],
            "responses": ["Under special cases, hostel fee can also be submitted in installments. You have to submit a General Request Form stating the reason and get it approved by the administration and submit it to the accounts office."]
      
        } ,

        {
            "tag": "duration of bs degree",
            "patterns": ["what is the maximum and minimum duration of bs cs","what is the maximum and minimum duration of bs ee","what is the maximum and minimum duration of bbs"],
            "responses": ["As mandated by HEC, BS Programs have a duration of 4 Years in FAST."]
      
        } ,

        {
            "tag": "disciplinary committee",
            "patterns": ["What is fast disciplinary committee?","what id dc in fast","what is dc?"],
            "responses": ["DC stands for disciplinary committee in FAST which ensures that the student code of conduct is being followed properly."]
      
        } ,

        {
            "tag": "gpa calculation",
            "patterns": ["how is cgpa calculated?"],
            "responses": ["CGPA is calculated on the basis of grades, each grade carries a fixed score out of a total score of 4.They are combined together at the end of the semester to calculate cgpa."]
      
        } ,

        {
            "tag": "What is CGPA",
            "patterns": ["What is CGPA?","What is gpa?"],
            "responses": ["Cumulative Grade point average (CGPA) is your academic performance tracker throughout your degree just like a score card in school."]
      
        } ,

        {
            "tag": "fail course",
            "patterns": ["What happens if I fail a course","What happens if I cannot pass a course?"],
            "responses": ["If you fail a course you have to repeat the course in the next semester. "]
      
        } ,

        {
            "tag": "number of installments",
            "patterns": ["how many installments can be done for tuition fee?",""],
            "responses": ["Generally 2 installments are done for the fee, but you can request for more in the form"]
      
        } ,

        {
            "tag": "fee installment",
            "patterns": ["can I pay my fee in installments?","Is fee installment option available?","Do I have to pay all the tuition fee at once?"],
            "responses": ["Yes you can pay your fee in installments to do that you have to submit a general request form to the committe stating your reason and get it approved by the committee head and then finally submit it to the accounts office."]
      
        }
    ]
}
    
    
    
      
      